# Q1 cutlets

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import scipy as stats
import seaborn as snb
from scipy import stats
from scipy.stats import norm

In [2]:
# A F&B manager wants to determine whether there is any significant difference in the diameter of the cutlet between two units.
# A randomly selected sample of cutlets was collected from both units and measured? Analyze the data and draw inferences at 
# 5% significance level. Please state the assumptions and tests that you carried out to check validity of the assumptions.

In [3]:
cut=pd.read_csv(r'C:\Users\bivin\OneDrive\Desktop\Cutlets.csv')

In [4]:
cut

    Unit A  Unit B
0   6.8090  6.7703
1   6.4376  7.5093
2   6.9157  6.7300
3   7.3012  6.7878
4   7.4488  7.1522
5   7.3871  6.8110
6   6.8755  7.2212
7   7.0621  6.6606
8   6.6840  7.2402
9   6.8236  7.0503
10  7.3930  6.8810
11  7.5169  7.4059
12  6.9246  6.7652
13  6.9256  6.0380
14  6.5797  7.1581
15  6.8394  7.0240
16  6.5970  6.6672
17  7.2705  7.4314
18  7.2828  7.3070
19  7.3495  6.7478
20  6.9438  6.8889
21  7.1560  7.4220
22  6.5341  6.5217
23  7.2854  7.1688
24  6.9952  6.7594
25  6.8568  6.9399
26  7.2163  7.0133
27  6.6801  6.9182
28  6.9431  6.3346
29  7.0852  7.5459
30  6.7794  7.0992
31  7.2783  7.1180
32  7.1561  6.6965
33  7.3943  6.5780
34  6.9405  7.3875

In [5]:
cut.describe(include='all')

          Unit A     Unit B
count  35.000000  35.000000
mean    7.019091   6.964297
std     0.288408   0.343401
min     6.437600   6.038000
25%     6.831500   6.753600
50%     6.943800   6.939900
75%     7.280550   7.195000
max     7.516900   7.545900

In [6]:
cut.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Unit A  35 non-null     float64
 1   Unit B  35 non-null     float64
dtypes: float64(2)
memory usage: 688.0 bytes

In [7]:
# Assume Null Hypothesis(Ho) sample1 mean=sample2 mean(no difference in diameter of cutlets)
# Alternative Hypothesis(Ha) sample1 mean=/ sample2 mean(differnce in diameter)

# this is a 2 sample 2 tailed t test
# to check at 5% significance level

In [8]:
unitA=pd.Series(cut.iloc[:,0])
unitA

0     6.8090
1     6.4376
2     6.9157
3     7.3012
4     7.4488
5     7.3871
6     6.8755
7     7.0621
8     6.6840
9     6.8236
10    7.3930
11    7.5169
12    6.9246
13    6.9256
14    6.5797
15    6.8394
16    6.5970
17    7.2705
18    7.2828
19    7.3495
20    6.9438
21    7.1560
22    6.5341
23    7.2854
24    6.9952
25    6.8568
26    7.2163
27    6.6801
28    6.9431
29    7.0852
30    6.7794
31    7.2783
32    7.1561
33    7.3943
34    6.9405
Name: Unit A, dtype: float64

In [9]:
unitB=pd.Series(cut.iloc[:,1])
unitB

0     6.7703
1     7.5093
2     6.7300
3     6.7878
4     7.1522
5     6.8110
6     7.2212
7     6.6606
8     7.2402
9     7.0503
10    6.8810
11    7.4059
12    6.7652
13    6.0380
14    7.1581
15    7.0240
16    6.6672
17    7.4314
18    7.3070
19    6.7478
20    6.8889
21    7.4220
22    6.5217
23    7.1688
24    6.7594
25    6.9399
26    7.0133
27    6.9182
28    6.3346
29    7.5459
30    7.0992
31    7.1180
32    6.6965
33    6.5780
34    7.3875
Name: Unit B, dtype: float64

In [10]:
s,p_value=stats.ttest_ind(unitA,unitB)

In [11]:
p_value

0.4722394724599501

In [12]:
if p_value<0.05:
    print('Reject null hypothesis,no differnce in diameter of cutlets')
else:
    print(' Failed to Reject null hypothesis,no differnce in diameter of cutlets')

 Failed to Reject null hypothesis,no differnce in diameter of cutlets

In [13]:
# inferenced at 5% 
# p_value>significance level,Accept Ho

# Q2 LAB

In [14]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import scipy as stats
import seaborn as snb
from scipy import stats
from scipy.stats import norm

In [15]:
df=pd.read_csv(r'C:\Users\bivin\OneDrive\Desktop\LabTAT.csv')
df

     Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0          185.35        165.53        176.70        166.13
1          170.49        185.91        198.45        160.79
2          192.77        194.92        201.23        185.18
3          177.33        183.00        199.61        176.42
4          193.41        169.57        204.63        152.60
..            ...           ...           ...           ...
115        178.49        170.66        193.80        172.68
116        176.08        183.98        215.25        177.64
117        202.48        174.54        203.99        170.27
118        182.40        197.18        194.52        150.87
119        182.09        215.17        221.49        162.21

[120 rows x 4 columns]

In [16]:
df.describe(include='all')

       Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
count    120.000000    120.000000    120.000000     120.00000
mean     178.361583    178.902917    199.913250     163.68275
std       13.173594     14.957114     16.539033      15.08508
min      138.300000    140.550000    159.690000     124.06000
25%      170.335000    168.025000    188.232500     154.05000
50%      178.530000    178.870000    199.805000     164.42500
75%      186.535000    189.112500    211.332500     172.88250
max      216.390000    217.860000    238.700000     205.18000

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Laboratory 1  120 non-null    float64
 1   Laboratory 2  120 non-null    float64
 2   Laboratory 3  120 non-null    float64
 3   Laboratory 4  120 non-null    float64
dtypes: float64(4)
memory usage: 3.9 KB

In [18]:
# here we have 4 sample so we draw the inferences at 5% significance level using the anova test

# Null Hypothesis(Ho)s1=s2=s3=s4(no difference in average turn around time)
# Alternative Hypothesis(Ha)s1=/s2=/s3=/s4(difference in average turn around time)

In [19]:
lab1=pd.Series(df.iloc[:,0])
lab1

0      185.35
1      170.49
2      192.77
3      177.33
4      193.41
        ...
115    178.49
116    176.08
117    202.48
118    182.40
119    182.09
Name: Laboratory 1, Length: 120, dtype: float64

In [20]:
lab2=pd.Series(df.iloc[:,1])

In [21]:
lab3=pd.Series(df.iloc[:,2])

In [22]:
lab4=pd.Series(df.iloc[:,3])

In [23]:
f,p_value=stats.f_oneway(lab1,lab2,lab3,lab4)

In [24]:
p_value

2.1156708949992414e-57

In [25]:
# at 5% significance level
# compare p_value with significance level

In [26]:
if p_value<0.05:
    print('Reject null hypothesis,difference in average turn around time(TAT)')
else:
    print('failed to reject null hypothesis,no difference in average turn around time(TAT)')

Reject null hypothesis,difference in average turn around time(TAT)

# Q3 Buyer ratio

In [27]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import scipy as stats
import seaborn as snb
from scipy import stats
from scipy.stats import norm

In [28]:
br=pd.read_csv(r'C:\Users\bivin\OneDrive\Desktop\BuyerRatio.csv')
br

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

In [29]:
br.describe()

             East         West        North       South
count    2.000000     2.000000     2.000000    2.000000
mean   242.500000   832.500000   743.500000  410.000000
std    272.236111   976.514465   866.205807  480.832611
min     50.000000   142.000000   131.000000   70.000000
25%    146.250000   487.250000   437.250000  240.000000
50%    242.500000   832.500000   743.500000  410.000000
75%    338.750000  1177.750000  1049.750000  580.000000
max    435.000000  1523.000000  1356.000000  750.000000

In [30]:
br=br.drop(columns=['Observed Values'])

In [31]:
chi2,p_value,df,exp=stats.chi2_contingency(br)
chi2,p_value

(1.595945538661058, 0.6603094907091882)

In [32]:
p_value

0.6603094907091882

In [44]:
# null hypothesis(Ho) All proportions are eqaul
# alternative hypothesis(Ha)not all proportins are equal

# we are taking significance level=0.05
# here p_value is greater than alpha value

In [34]:
if p_value<0.05:
    print('reject null hypothesis,not all proportion are equal')
else:
    print('failed to reject null hypothesis,all proportions are equal')

failed to reject null hypothesis,all proportions are equal

# Q4 customer

In [35]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import scipy as stats
import seaborn as snb
from scipy import stats
from scipy.stats import norm

In [36]:
cust=pd.read_csv(r'C:\Users\bivin\OneDrive\Desktop\Customer+OrderForm.csv')
cust

    Phillippines   Indonesia       Malta       India
0     Error Free  Error Free   Defective  Error Free
1     Error Free  Error Free  Error Free   Defective
2     Error Free   Defective   Defective  Error Free
3     Error Free  Error Free  Error Free  Error Free
4     Error Free  Error Free   Defective  Error Free
..           ...         ...         ...         ...
295   Error Free  Error Free  Error Free  Error Free
296   Error Free  Error Free  Error Free  Error Free
297   Error Free  Error Free   Defective  Error Free
298   Error Free  Error Free  Error Free  Error Free
299   Error Free   Defective   Defective  Error Free

[300 rows x 4 columns]

In [58]:
# null hypothesis(Ho) defective % does not vary by center
# alternative hypothesis(Ha) defective % vary by center

# significance level=0.05

In [40]:
cust.Phillippines.value_counts()

Error Free    271
Defective      29
Name: Phillippines, dtype: int64

In [41]:
cust.Indonesia.value_counts()

Error Free    267
Defective      33
Name: Indonesia, dtype: int64

In [42]:
cust.Malta.value_counts()

Error Free    269
Defective      31
Name: Malta, dtype: int64

In [43]:
cust.India.value_counts()

Error Free    280
Defective      20
Name: India, dtype: int64

In [55]:
obs=np.array([[271,267,269,280],[29,33,31,20]])
obs

array([[271, 267, 269, 280],
       [ 29,  33,  31,  20]])

In [56]:
chi2,p_value,df,exp=stats.chi2_contingency(obs)

In [57]:
p_value

0.2771020991233135

In [59]:
if p_value<0.05:
    print('reject Ho,defective % vary by center')
else:
    print('failed to reject Ho,defective % does not vary by center')

failed to reject Ho,defective % does not vary by center